src/config/Reports/ОтчетПоГрузчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ОтчетПоГрузчикам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/AccumulationRegisters/ДанныеПоГрузчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДанныеПоГрузчикам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесДиски</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИмпорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВыходные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесПеремещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/ОперацияПоОтветственномуХранению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ОперацияПоОтветственномуХранению</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоОтветственномуХранению</xr:Item>
				<xr:Item>Document.ЗаявкаНаВозвратТоваров</xr:Item>
				<xr:Item>Document.ЗаявкаНаБрак</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДанныеПоГрузчикам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыАдресноеХранение</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаОтветственномХранении</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоОтветственномуХранению</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоОтветственномуХранению</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаБрак</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоПогрузке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бригадир</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыАдресноеХранение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Catalogs/ГруппыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГруппыСкладов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Транзит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Reports/ОтчетПоГрузчикам/Ext/ObjectModule.bsl
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт
    //ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонДата", НачалоДня(КонецДня(ОбщийОтчет.ДатаКон)+1));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонДата", Новый Граница(КонецДня(ОбщийОтчет.ДатаКон),ВидГраницы.Включая));

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачДата", ОбщийОтчет.ДатаНач);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Расценка", ЭтотОбъект.Расценка);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Подразделение", ЭтотОбъект.Подразделение);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ПодразделениеТранзит",  ?( РольДоступна("ПравоЗавершенияРаботыПользователей"), Ложь,  //26.04.2016 - для нас - НЕ искаженная картина
				ЭтотОбъект.Подразделение.ОбособленноеПодразделение));
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	СтруктураПредставлениеПолей = Новый Структура;
	МассивОтбора = Новый Массив;
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	


Текст= "ВЫБРАТЬ 
| ВесОборот,
| ВесНеттоОборот,
| //ВесДискиОборот,
| //ВесИмпортОборот,
| //ВесВыходныеОборот,
| //ВесПеремещенияОборот,
| СуммаНетто,
| СуммаДиски,
| СуммаИмпорт,
| СуммаВыходные,
| СуммаПеремещения,
| СуммаИтого
| {ВЫБРАТЬ
| Сотрудник,
| ВидДокумента,
| Регистратор,
| 0 тест,
| ВесОборот,
| ВесНеттоОборот,
| //ВесДискиОборот,
| //ВесИмпортОборот,
| //ВесВыходныеОборот,
| //ВесПеремещенияОборот,
| СуммаНетто,
| СуммаДиски,
| СуммаИмпорт,
| СуммаВыходные,
| СуммаПеремещения,
| СуммаИтого,
|	НачалоПериода(Период, День) КАК ПериодДень ,
|	НачалоПериода(Период, Месяц) КАК ПериодМесяц 
|  }
| ИЗ
|	(ВЫБРАТЬ
|	Сотрудник,
|	ВЫБОР
|		КОГДА Регистратор ССЫЛКА Документ.ОперацияПоОтветственномуХранению
|			ТОГДА ""Ответ. хранение""
|			КОГДА Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
|			ТОГДА ""Реализация""
|			КОГДА Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
|			ТОГДА ""Поступление""
|			КОГДА Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры
|			ТОГДА ""Комплектация""
|			КОГДА Регистратор ССЫЛКА Документ.ПеремещениеТоваров
|			ТОГДА ""Перемещение""
|
|
|		ИНАЧЕ ""ИНОЕ""
|	КОНЕЦ КАК ВидДокумента,
|	Регистратор,
|	ВесОборот,
|	ВесНеттоОборот,
|	//ВесДискиОборот,
|	//ВесИмпортОборот,
|	//ВесВыходныеОборот,
|	//ВесПеремещенияОборот,
|   ВесНеттоОборот*&Расценка СуммаНетто,
|	ВесДискиОборот*&Расценка СуммаДиски,
|	ВесИмпортОборот*&Расценка СуммаИмпорт,
|	ВесВыходныеОборот*&Расценка СуммаВыходные,
|   ВесПеремещенияОборот*&Расценка СуммаПеремещения,
|	ВесОборот*&Расценка СуммаИтого,
|   Период
|
|ИЗ
|	РегистрНакопления.ДанныеПоГрузчикам.Обороты(&НачДата, &КонДата, Регистратор, )) КАК ДанныеПоГрузчикамОбороты
//+++ 19.02.2016  --- 21.03.2018
|ГДЕ ДанныеПоГрузчикамОбороты.Регистратор.Подразделение В ИЕРАРХИИ (&Подразделение)

//+++ 26.04.2016 - ограничение по грузчикам подразделения
| И выбор когда &ПодразделениеТранзит тогда
|	ДанныеПоГрузчикамОбороты.Сотрудник 
|	В (ВЫБРАТЬ РАЗЛИЧНЫЕ ГруппыСкладовСостав.ФизЛицо 
|	   ИЗ Справочник.ГруппыСкладов.Состав как ГруппыСкладовСостав
|	   ГДЕ ГруппыСкладовСостав.ссылка.Транзит 
|      ) 
| иначе Истина Конец

| УПОРЯДОЧИТЬ ПО Сотрудник.Наименование
|{УПОРЯДОЧИТЬ ПО
|Сотрудник.*
|}
| { ГДЕ Сотрудник,ВидДокумента, Регистратор.*}
|
|{ИТОГИ ПО
|Сотрудник,ВидДокумента,Регистратор.*,
|	НачалоПериода(Период, День) КАК ПериодДень ,
|	НачалоПериода(Период, Месяц) КАК ПериодМесяц
|}
| ИТОГИ

|	СУММА(ВесОборот),
|	СУММА(ВесНеттоОборот),
|	//СУММА(ВесДискиОборот),
|	//СУММА(ВесИмпортОборот),
|	//СУММА(ВесВыходныеОборот),
|	//СУММА(ВесПеремещенияОборот),
|	СУММА(СуммаНетто),
|	СУММА(СуммаДиски),
|	СУММА(СуммаИмпорт),
|	СУММА(СуммаВыходные),
|	СУММА(СуммаПеремещения),
|	СУММА(СуммаИтого)
|ПО ОБЩИЕ,Сотрудник
|";


	
	СтруктураПредставлениеПолей = Новый Структура("
	|ПериодДень,
	|ПериодМесяц",
	"По дням",	
	"По месяцам");

	
		
	ПостроительОтчета.Текст = Текст;
	
	
	ОбщийОтчет.ЗаполнитьПоказатели("ВесОборот", "Вес ИТОГО, кг.", Истина, "ЧЦ=10; ЧДЦ=3");
	
	ОбщийОтчет.ЗаполнитьПоказатели("ВесНеттоОборот", "Вес нетто, кг.", Истина, "ЧЦ=10; ЧДЦ=3");
	//ОбщийОтчет.ЗаполнитьПоказатели("ВесДискиОборот", "Вес (диски)", Истина, "ЧЦ=10; ЧДЦ=3");
	//ОбщийОтчет.ЗаполнитьПоказатели("ВесИмпортОборот", "Вес (импорт)", Истина, "ЧЦ=10; ЧДЦ=3");
	//ОбщийОтчет.ЗаполнитьПоказатели("ВесВыходныеОборот", "Вес (выходные)", Истина, "ЧЦ=10; ЧДЦ=3");
	//ОбщийОтчет.ЗаполнитьПоказатели("ВесПеремещенияОборот", "Вес (перемещения)", Истина, "ЧЦ=10; ЧДЦ=3");
	
	ОбщийОтчет.ЗаполнитьПоказатели("СуммаНетто", "Сумма за погр./разгр.", Истина, "ЧЦ=10; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("СуммаДиски", "Сумма за диски", Истина, "ЧЦ=10; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели("СуммаИмпорт", "Сумма за импорт", Истина, "ЧЦ=10; ЧДЦ=2");
	
	//+++ 26.04.2013 - просто переименовано поле!
	//ОбщийОтчет.ЗаполнитьПоказатели("СуммаВыходные", "Сумма за выходные", Истина, "ЧЦ=10; ЧДЦ=2");
	 ОбщийОтчет.ЗаполнитьПоказатели("СуммаВыходные", "Сумма за переработку", Истина, "ЧЦ=10; ЧДЦ=2");
	 
	 //+++ 10.06.2015
	 ОбщийОтчет.ЗаполнитьПоказатели("СуммаПеремещения", "Сумма за перемещения", Истина, "ЧЦ=10; ЧДЦ=2");
	 
	 
	ОбщийОтчет.ЗаполнитьПоказатели("СуммаИтого", "Сумма ИТОГО", Истина, "ЧЦ=10; ЧДЦ=2");

	
	
	ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	//ОбщийОтчет.ПостроительОтчета.ИзмеренияСтроки.Добавить("Программа");
	//ОбщийОтчет.ПостроительОтчета.ИзмеренияСтроки.Добавить("Производитель");
	//ОбщийОтчет.ПостроительОтчета.ИзмеренияКолонки.Добавить("Вид");
	
	ОбщийОтчет.мНазваниеОтчета = "Отчет по грузчикам";

КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший порцедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

ОбщийОтчет.ИмяРегистра = "Данные по грузчикам";
ОбщийОтчет.мНазваниеОтчета = "Отчет по грузчикам";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мВыбиратьИспользованиеСвойств=Ложь;
ОбщийОтчет.мРежимВводаПериода = 0;
ОбщийОтчет.ВыводитьПоказателиВСтроку=Истина;
